Revit 2026 API

# UIApplicationRemoveAddInCommandBinding Method

---

Removes an AddInCommandBinding.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveAddInCommandBinding(
	RevitCommandId revitCommandId
)
```
```vb
Public Sub RemoveAddInCommandBinding (
	revitCommandId As RevitCommandId
)
```
```cpp
public:
void RemoveAddInCommandBinding(
	RevitCommandId^ revitCommandId
)
```
```fsharp
member RemoveAddInCommandBinding :
        revitCommandId : RevitCommandId -> unit
```

#### Parameters

revitCommandId RevitCommandId
    The Revit command id to identify the command handler you want to remove the binding.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when uiApplication or revitCommandId is . |
| InvalidOperationException | Thrown when the given command is not bound with this add-in. |

#### Reference

UIApplication Class

Autodesk.Revit.UI Namespace